### How to import documents using Pandas

## 1. Excel

In [1]:
import pandas as pd

df_excel = pd.read_excel('input/multiple.xlsx')
df_excel.head(2)

        Date    Open    High     Low   Close   Volume  Adj Close
0 2014-04-17  199.61  202.29  194.08  198.12  5926800     198.12
1 2014-04-16  197.00  199.99  190.82  199.11  7202200     199.11

## 2. CSV

In [2]:
import pandas as pd
df_csv = pd.read_csv('input/world_temp.csv')
df_csv.head(2)

   year     city        country  avg_temp
0  1849  Abidjan  C么te D'Ivoire     25.58
1  1850  Abidjan  C么te D'Ivoire     25.52

## 3. TXT

In [52]:
import pandas as pd
df_txt = pd.read_csv('input/savingsrate.txt')
df_txt.head()

         DATE         RATE
0  1959-01-01          8.3
1  1959-02-01          7.7
2  1959-03-01          7.4
3  1959-04-01          8.3
4  1959-05-01          7.8

### Remove white space from columns

In [53]:
# display column names
cols = df_txt.columns.tolist()
cols

['DATE', '       RATE']

### Summarizing the Data

In [54]:
# remove whitespace
df_txt.columns = [i.strip() for i in cols]
cols = df_txt.columns.tolist()
cols

['DATE', 'RATE']

In [55]:
# how many rows the dataset
df_txt['RATE'].count()

648

In [56]:
# get the max number
df_txt['RATE'].max()

14.6

In [61]:
1700+4800

6500

In [58]:
import dateutil

df_txt['DATE'] = df_txt['DATE'].apply(dateutil.parser.parse, dayfirst=True)

In [59]:
df_txt.head(2)

        DATE  RATE
0 1959-01-01   8.3
1 1959-01-02   7.7

In [60]:
df_txt.head()

        DATE  RATE
0 1959-01-01   8.3
1 1959-01-02   7.7
2 1959-01-03   7.4
3 1959-01-04   8.3
4 1959-01-05   7.8